Revit 2026 API

# NumericRevisionSettingsPrefix Property

---

The prefix string that will be prepended to the number of each revision with Numeric RevisionNumberingType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Prefix { get; set; }
```
```vb
Public Property Prefix As String
	Get
	Set
```
```cpp
public:
property String^ Prefix {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Prefix : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace